[
    {
        "version": "0.2.1",
        "date": "31/05/2014",
        "changes": {
            "misc": [
                "Procesamiento de imágenes: se puede comprimir la imagen de cubierta y autor, redimensión automática, insertar el logo de epublibre a la imagen de cubierta y generar la cubierta para la web.",
                "Agregados algunos atajos de teclado: CTRL-A para abrir un docx y F10 para generar el epub.",
                "Se muestra una especie de diálogo de progreso al generar un epub.",
                "Se eliminan caracteres no válidos del nombre de archivo del epub.",
                "Bug corregido: si el campo de sinopsis o biografía de autor tenía caracteres de control, se producía un error al generar el epub."
            ],
            "docx": [
                "Mejora el procesamiento de tablas.",
                "Procesa saltos de líneas manuales (SHIFT+ENTER en Word).",
                "Bug corregido: no se procesaban las tablas en las notas al pie.",
                "Bug corregido relacionado con el procesamiento de cuadros de texto."
            ]
        }
    },
    {
        "version": "0.2.0",
        "date": "11/04/2014",
        "changes": {
            "misc": [
                "Actualizado a ePub base r1.1.",
                "Se comprueba que no haya pérdida de texto en una conversión.",
                "Agregada opción para no incluir los archivos opcionales del ePub base (dedicatoria.xhtml y autor.xhtml) si los campos respectivos no se completaron. La opción se encuentra en 'Preferencias' -> 'Generación de Epub' -> 'Siempre incluir archivos opcionales'.",
                "Eliminado campo editoral: es siempre 'ePubLibre' por defecto.",
                "Modificada la pestaña de 'Autores': se puede especificar biografía e imagen de todos los autores ingresados.",
                "Algunos cambios en la GUI, como por ejemplo, se elimina la ventana del log de conversión: pienso reemplazarlo por algo más adecuado.",
                "Las secciones del epub generado se numeran comenzando en Section0001.xhtml, en lugar de Section0000.xhtml.",
                "Varias correciones y mejoras menores, como por ejemplo recordar la carpeta donde se guardó un epub cuando este no tenía asociado ningún docx."
            ],
            "docx": [
                "Corregido en gran parte el problema de los saltos de página, que hacía necesario que estuvieran en su propio párrafo (insertando un salto de línea antes y después) para asegurarse de que el epubcreator cortara las secciones correctamente. Ya no es necesario hacer esto en la gran mayoría de los casos.",
                "Procesa de manera básica listas y tablas.",
                "Corregidos varios bugs, el más grave cuando se mezclaban estilos personalizados de tipo 'Carácter' con formatos (negrita, itálica, etc)."
            ]
        }
    },
    {
        "version": "0.1.4",
        "date": "15/12/2013",
        "changes": {
            "docx": [
                "Corregido bug en el uso de estilos personalizados de tipo 'Párrafo'."
            ]
        }
    },
    {
        "version": "0.1.3",
        "date": "13/11/2013",
        "changes": {
            "docx": [
                "Corregido bug que provocaba, en algunos casos, que un párrafo se obviara."
            ]
        }
    },
    {
        "version": "0.1.2",
        "date": "01/09/2013",
        "changes": {
            "misc": [
                "Agregado menú acerca de.",
                "Corregidos algunos tooltips.",
                "Se muestra un mensaje en la barra de estado informando si el ePub se generó correctamente u ocurrió algún error.",
                "En linux y mac a veces no se mostraban los mensajes en la barra de estado. Corregido.",
                "Cuando hay varios autores o ilustradores, en los metadatos se los separa con un '&'."
            ],
            "docx": [
                "Se procesan los estilos vinculados a carácter.",
                "Si dos o más párrafos consecutivos comparten un mismo estilo, son colocados dentro de un div.",
                "Se tienen en cuenta los formatos que un estilo tenga aplicado."
            ]
        }
    },
    {
        "version": "0.1.1",
        "date": "27/08/2013",
        "changes": {
            "misc": [
                "Sigil no se abría en mac y daba el siguiente error: 'Permission denied'. Corregido.",
                "Se genera en la toc la entrada correspondiente al elemento h1 de autor.xhtml.",
                "Se genera en la toc la entrada correspondiente al elemento h1 de notas.xhtml.",
                "Se genera en la toc la entrada correspondiente al elemento h1 de titulo.xhtml.",
                "Si el número de colección tiene ceros a la izquierda, se eliminan en los metadatos de calibre."
            ],
            "docx": [
                "En algunos casos, la numeración de las notas comenzaba desde el dos. Corregido."
            ]
        }
    },
    {
        "version": "0.1.0",
        "date": "17/08/2013",
        "changes": {
            "misc": [
                "Versión inicial."
            ]
        }
    }
]